In [1]:
import pandas as pd
import numpy as np

In [2]:
data1 = {
    "id" : [1, 2, 3, 4],
    "salary" : ["100", "200", "300", "200"]
}

data2 = {
    "id" : [1],
    "salary" : ["100"]
}

In [3]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [4]:
df1

   id salary
0   1    100
1   2    200
2   3    300
3   4    200

In [5]:
df2

   id salary
0   1    100

In [6]:
df1 = df1.drop_duplicates(subset=['salary'], keep='first')
#df = df1.sort_values(by = 'salary', ascending = False)df1

In [8]:
df1 = df1.sort_values(by='salary', ascending=False)

In [9]:
df1

   id salary
2   3    300
1   2    200
0   1    100

In [12]:
df1['salary'].iloc[1]

'200'